---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.Macros.ApplicationEntryPoint
source: html/7c8b4e9a-9072-2281-c276-eea5b7c3a955.htm
---
# ApplicationEntryPoint Members

Initializes a new instance of the ApplicationEntryPoint class